- 목차 -

1.요구사항 확인
가. 소프트웨어 개발 방법론
나. 현행 시스템 분석
다. 요구사항 확인
라. 분석 모델 확인하기

2.화면 설계
가. UI 요구사항 확인
나. UI 설계

3.데이터 입출력 구현
가. 논리 데이터 저장소 확인
나. 물리 데이터 저장소 설계
다. 데이터베이스 기초 활용하기

4.통합 구현
가. 연계 데이터 구성
나. 연계 메커니즘 구성
다. 내외부 연계모둘 구현

5.인터페이스 구현
가. 인터페이스 설계 확인
나. 인터페이스 기능 구현
다. 인터페이스 구현 검증

6.프로그래밍 언어 활용
가. 기본 문법 활용하기
나. 언어 특성 활용하기

7.SQL 응용
가. 데이터베이스 기본
나. 응용 SQL 작성하기
다. 절차형 SQL 활용하기
라. 데이터 조작 프로시저 최적화

8.서버 프로그램 구현
가. 개발환경 구축
나. 공통 모듈 구현
다. 서버 프로그램 구현
라. 배치 프로그램 구현

9.소프트웨어 개발 보안 구축
가. 소프트웨어 개발 보안 설계
나. 소프트웨어 개발 보안 구현

10.애플리케이션 테스트 관리
가. 애플리케이션 테스트 케이스 설계
나. 애플리케이션 통합 테스트
다. 애플리케이션 성능 개선

11.응용 SW 기초 기술 활용
가. 운영체제의 특징
나. 네트워크 기초 활용하기
다. 기본 개발환경 구축하기

12.제품 소프트웨어 패키징
가. 제품 소프트웨어 패키징하기
나. 제품 소프트웨어 메뉴얼 작성 및 버전 등록
